package lesson_12

//Программа отслеживает погоду по дням.
//Создай класс для хранения данных о температуре и осадках для одного дня.
//
//Объекты класса будут хранить:
//
//- дневная температура;
//- ночная температура;
//- наличие осадков в течение суток.
//
//Создай два объекта, присвой им произвольные данные и выведи в консоль одним методом созданного класса.
//
//- в классе создай переменные и проинициализируй их какими-нибудь значениями;
//- затем в созданных объектах подставь другие значения этим переменным.
//
//В этой задаче используй пустой конструктор.

fun main() {

    val july16 = WeatherMetrics(26, 20, false)
    val july17 = WeatherMetrics(35, 26, true)
    
}

class WeatherMetrics(_dayTemp: Int, _nightTemp: Int, _isRainyToday: Boolean) {

    var dayTemp: Int = _dayTemp
    var nightTemp: Int = _nightTemp
    var isRainyToday: Boolean = _isRainyToday

    init {
        println("""
            МЕТРИКИ:
            Дневная температура: ${dayTemp}
            Ночная температура: ${nightTemp}
            Есть ли осадки: ${isRainyToday}
        """.trimIndent())
    }

}